betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_flash.c
  if(pFlash.ProcedureOnGoing == FLASH_PROC_NONE)
  {
#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Operation is completed, disable the PG, PAGEERA and MASSERA Bits */
    CLEAR_BIT(FLASH->CTRL2, (FLASH_CTRL2_PG | FLASH_CTRL2_PAGEERA | FLASH_CTRL2_MASSERA));
#else
    /* Operation is completed, disable the PG, SERS, SNUM and MER Bits */
    CLEAR_BIT(FLASH->CTRL, (FLASH_CTRL_PG | FLASH_CTRL_SERS | FLASH_CTRL_SNUM | FLASH_MER_BIT));
#endif /* APM32F403 || APM32F402xx */

    /* Disable End of FLASH Operation interrupt */
    __DAL_FLASH_DISABLE_IT(FLASH_IT_EOP);

    /* Disable Error source interrupt */
    __DAL_FLASH_DISABLE_IT(FLASH_IT_ERR);

    /* Process Unlocked */
    __DAL_UNLOCK(&pFlash);
  }
}

/**
  * @brief  FLASH end of operation interrupt callback
  * @param  ReturnValue The value saved in this parameter depends on the ongoing procedure
  *                  Mass Erase: Bank number which has been requested to erase
  *                  Sectors Erase: Sector which has been erased
  *                    (if 0xFFFFFFFFU, it means that all the selected sectors have been erased)
  *                  Program: Address which was selected for data program
  * @retval None
  */
__weak void DAL_FLASH_EndOfOperationCallback(uint32_t ReturnValue)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ReturnValue);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_FLASH_EndOfOperationCallback could be implemented in the user file
   */
}

/**
  * @brief  FLASH operation error interrupt callback
  * @param  ReturnValue The value saved in this parameter depends on the ongoing procedure
  *                 Mass Erase: Bank number which has been requested to erase
  *                 Sectors Erase: Sector number which returned an error
  *                 Program: Address which was selected for data program
  * @retval None
  */
__weak void DAL_FLASH_OperationErrorCallback(uint32_t ReturnValue)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ReturnValue);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_FLASH_OperationErrorCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup FLASH_Exported_Functions_Group2 Peripheral Control functions
 *  @brief   management functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the FLASH
    memory operations.

@endverbatim
  * @{
  */

/**
  * @brief  Unlock the FLASH control register access
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_FLASH_Unlock(void)
{
  DAL_StatusTypeDef status = DAL_OK;

#if defined(APM32F403xx) || defined(APM32F402xx)
  if(READ_BIT(FLASH->CTRL2, FLASH_CTRL2_LOCK) != RESET)
  {
    /* Authorize the FLASH Registers access */
    WRITE_REG(FLASH->KEY, FLASH_KEY1);
    WRITE_REG(FLASH->KEY, FLASH_KEY2);

    /* Verify Flash is unlocked */
    if(READ_BIT(FLASH->CTRL2, FLASH_CTRL2_LOCK) != RESET)
    {
      status = DAL_ERROR;
    }
  }
#else
  if(READ_BIT(FLASH->CTRL, FLASH_CTRL_LOCK) != RESET)
  {
    /* Authorize the FLASH Registers access */
    WRITE_REG(FLASH->KEY, FLASH_KEY1);
    WRITE_REG(FLASH->KEY, FLASH_KEY2);

    /* Verify Flash is unlocked */
    if(READ_BIT(FLASH->CTRL, FLASH_CTRL_LOCK) != RESET)
    {
      status = DAL_ERROR;
    }
  }
#endif /* APM32F403xx || APM32F402xx */

  return status;
}

/**
  * @brief  Locks the FLASH control register access
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_FLASH_Lock(void)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  /* Set the LOCK Bit to lock the FLASH Registers access */
  FLASH->CTRL2 |= FLASH_CTRL2_LOCK;
#else
  /* Set the LOCK Bit to lock the FLASH Registers access */
  FLASH->CTRL |= FLASH_CTRL_LOCK;
#endif /* APM32F403xx || APM32F402xx */

  return DAL_OK;
}

/**
  * @brief  Unlock the FLASH Option Control Registers access.
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_FLASH_OB_Unlock(void)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  if((FLASH->CTRL2 & FLASH_CTRL2_OBWEN) != RESET)
#else
  if((FLASH->OPTCTRL & FLASH_OPTCTRL_OPTLOCK) != RESET)
#endif /* APM32F403xx || APM32F402xx */
  {
    /* Authorizes the Option Byte register programming */
    FLASH->OPTKEY = FLASH_OPT_KEY1;
    FLASH->OPTKEY = FLASH_OPT_KEY2;
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Lock the FLASH Option Control Registers access.
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_FLASH_OB_Lock(void)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  /* Clear the OPTWRE Bit to lock the FLASH Option Byte Registers access */
  CLEAR_BIT(FLASH->CTRL2, FLASH_CTRL2_OBWEN);
#else
  /* Set the OPTLOCK Bit to lock the FLASH Option Byte Registers access */
  FLASH->OPTCTRL |= FLASH_OPTCTRL_OPTLOCK;
#endif /* APM32F403xx || APM32F402xx */

  return DAL_OK;
}

#if defined(APM32F403xx) || defined(APM32F402xx)
/**
  * @brief  Launch the option byte loading.
  * @retval None
  */
void DAL_FLASH_OB_Launch(void)
{
  /* Initiates a system reset request to launch the option byte loading */
  DAL_NVIC_SystemReset();
}
#else
/**
  * @brief  Launch the option byte loading.
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_FLASH_OB_Launch(void)
{
  /* Set the OPTSTRT bit in OPTCR register */
  *(__IO uint8_t *)OPTCTRL_BYTE0_ADDRESS |= FLASH_OPTCTRL_OPTSTART;

  /* Wait for last operation to be completed */
  return(FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE));
}
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

/** @defgroup FLASH_Exported_Functions_Group3 Peripheral State and Errors functions
 *  @brief   Peripheral Errors functions
 *
@verbatim
 ===============================================================================
                ##### Peripheral Errors functions #####
 ===============================================================================
    [..]
    This subsection permits to get in run-time Errors of the FLASH peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Get the specific FLASH error flag.
  * @retval FLASH_ErrorCode: The returned value can be a combination of:
  *            @arg DAL_FLASH_ERROR_RD: FLASH Read Protection error flag (PCROP)
  *            @arg DAL_FLASH_ERROR_PGS: FLASH Programming Sequence error flag
  *            @arg DAL_FLASH_ERROR_PGP: FLASH Programming Parallelism error flag
  *            @arg DAL_FLASH_ERROR_PGA: FLASH Programming Alignment error flag
  *            @arg DAL_FLASH_ERROR_WRP: FLASH Write protected error flag
  *            @arg DAL_FLASH_ERROR_OPERATION: FLASH operation Error flag
  */
uint32_t DAL_FLASH_GetError(void)
{
   return pFlash.ErrorCode;
}

/**
  * @}
  */

/**
  * @brief  Wait for a FLASH operation to complete.
  * @param  Timeout maximum flash operationtimeout
  * @retval DAL Status
  */
DAL_StatusTypeDef FLASH_WaitForLastOperation(uint32_t Timeout)
{
  uint32_t tickstart = 0U;

  /* Clear Error Code */
  pFlash.ErrorCode = DAL_FLASH_ERROR_NONE;

