betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_flash.c
  /* If the previous operation is completed, proceed to program the new data */
  CLEAR_BIT(FLASH->CTRL, FLASH_CTRL_PGSIZE);
  FLASH->CTRL |= FLASH_PSIZE_BYTE;
  FLASH->CTRL |= FLASH_CTRL_PG;

  *(__IO uint8_t*)Address = Data;
}
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @brief  Set the specific FLASH error flag.
  * @retval None
  */
static void FLASH_SetErrorCode(void)
{
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_WRPERR) != RESET)
  {
   pFlash.ErrorCode |= DAL_FLASH_ERROR_WRP;

   /* Clear FLASH write protection error pending bit */
   __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_WRPERR);
  }

#if defined(FLASH_FLAG_PGAERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_PGAERR) != RESET)
  {
   pFlash.ErrorCode |= DAL_FLASH_ERROR_PGA;

   /* Clear FLASH Programming alignment error pending bit */
   __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_PGAERR);
  }
#endif /* FLASH_FLAG_PGAERR */

#if defined(FLASH_FLAG_PGPERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_PGPERR) != RESET)
  {
    pFlash.ErrorCode |= DAL_FLASH_ERROR_PGP;

    /* Clear FLASH Programming parallelism error pending bit */
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_PGPERR);
  }
#endif /* FLASH_FLAG_PGPERR */

#if defined(FLASH_FLAG_PGSERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_PGSERR) != RESET)
  {
    pFlash.ErrorCode |= DAL_FLASH_ERROR_PGS;

    /* Clear FLASH Programming sequence error pending bit */
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_PGSERR);
  }
#endif /* FLASH_FLAG_PGSERR */

#if defined(FLASH_STS_RPROERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_RDERR) != RESET)
  {
    pFlash.ErrorCode |= DAL_FLASH_ERROR_RD;

    /* Clear FLASH Proprietary readout protection error pending bit */
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_RDERR);
  }
#endif /* FLASH_STS_RPROERR */

#if defined(FLASH_FLAG_OPERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_OPERR) != RESET)
  {
    pFlash.ErrorCode |= DAL_FLASH_ERROR_OPERATION;

    /* Clear FLASH Operation error pending bit */
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPERR);
  }
#endif /* FLASH_FLAG_OPERR */

#if defined(FLASH_FLAG_PGERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_PGERR) != RESET)
  {
    pFlash.ErrorCode |= DAL_FLASH_ERROR_PROG;

    /* Clear FLASH Operation error pending bit */
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_PGERR);
  }
#endif /* FLASH_FLAG_PGERR */

#if defined(FLASH_FLAG_OPTVERR)
  if(__DAL_FLASH_GET_FLAG(FLASH_FLAG_OPTVERR))
  {
    pFlash.ErrorCode |= DAL_FLASH_ERROR_OPTV;
  __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);
  }
#endif /* FLASH_FLAG_OPTVERR */
}

/**
  * @}
  */

#endif /* DAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

